{
  "index.html": {
    "template": "standard.pug",
    "description": "Homepage",
    "includeContactInformation": true,
    "title": "Hello!",
    "paragraphs": [
      "My name is Gordon Reid.",
      "I am a graduate from the University of Glasgow living in Falkirk.",
      "I will be posting information about my public programming projects on this website. I have experience in many languages including: C, Fortran, Java, and Python. As part of my University course I have created applications using OpenCL, enabling the execution of the algorithm on various classes of device including a GPU and the Intel Xeon Phi, improving performance on a heterogeneous shared-memory system. I have also used MPI and a novel model coupling framework to parallelise a scientific model written in Fortran. The ability to make use of distributed-memory systems has allowed larger area or finer grained areas to be simulated, improving the accuracy of results. More details on all projects are available by visiting the Project page.",
      "My <a href=\"/pdf/gordon-reid-cv.pdf\">CV</a> and <a href=\"/pdf/gordon-reid-transcript.pdf\">transcript</a> are available for download."
    ]
  },
  "interests/index.html": {
    "template": "interests.pug",
    "description": "My hobbies and interests",
    "interests": [
      {
        "key": "3DPrinting",
        "title": "3D Printing"
      }
    ]
  },
  "interests/3DPrinting/index.html": {
    "template": "interest.pug",
    "description": "3D Printing",
    "interest": {
      "title": "3D Printing",
      "description": "I have a 3D printer. Content TBD"
    }
  },
  "projects/index.html": {
    "template": "projects.pug",
    "description": "List of software development projects",
    "projects": [
      {
        "key": "DocumentFiltering",
        "title": "GPU-Accelerated Document Filtering in OpenCL"
      },
      {
        "key": "LES",
        "title": "Exploring the parallelisation of the Large Eddy Simulation using MPI and the Glasgow Model Coupling Framework in Fortran"
      },
      {
        "key": "PersonalWebsite",
        "title": "This website"
      }
    ]
  },
  "projects/DocumentFiltering/index.html": {
    "template": "project.pug",
    "description": "Information on 4th year undergraduate project",
    "project": {
      "title": "GPU-Accelerated Document Filtering in OpenCL",
      "description": "Document filtering a is problem of growing importance. The advent of the Internet has resulted in a massive surge in the transfer and storage of data and information. A prime example is email where hundreds of billions are sent every day. Emails, and other kinds of documents, require to be filtered. This problem is highly data parallel in nature as the classification of one document does not affect the classification of another. The project investigates the viability of using GPUs rather than CPUs for the classification. GPUs are designed with parallel problems in mind and thus have the potential to allow for significantly higher throughput compared with CPUs.",
      "github_url": "https://github.com/gordon1992/Level4Project"
    }
  },
  "projects/LES/index.html": {
    "template": "project.pug",
    "description": "Information on final year undergraduate project",
    "project": {
      "title": "Exploring the parallelisation of the Large Eddy Simulation using MPI and the Glasgow Model Coupling Framework in Fortran",
      "description": "Climate scientists write a number of applications to simulate aspects of our planet's ecosystem. These are sometimes coupled with other simulations using model coupling frameworks. This improves the accuracy of results and allows climate scientists to model more complicated scenarios. The Glasgow Model Coupling Framework (GMCF) is a new kind of model coupling framework that can also be used to parallelise individual models. By comparing LES performance when parallelised by MPI and GMCF, it is shown that GMCF offers competitive performance with MPI while also providing model coupling functionality.",
      "github_url": "https://github.com/gordon1992/LES-WRF-MPI"
    }
  },
  "projects/PersonalWebsite/index.html": {
    "template": "project.pug",
    "description": "Information on the project that generates this website",
    "project": {
      "title": "This website",
      "description": "This website is hosted on github.io and I have written a very basic TypeScript wrapper around pug which reads in a JSON file called pages.json and generates the required HTML pages. It's a \"static website generator\" of sorts but one that only contains sufficient functionality for my use cases and nothing else.",
      "github_url": "https://github.com/gordon1992/Personal-Website"
    }
  },
  "404.html": {
    "template": "404.pug",
    "description": "404 - Page Not Found"
  }
}
