{
  "blog/index.html": {
    "template": "list.pug",
    "description": "List of blog posts",
    "title": "Blog Posts",
    "directory": "blog",
    "list": [
      {
        "key": "PhotographyChallenge/Week4",
        "title": "Photography Challenge - Week 4 - Black and White"
      },
      {
        "key": "PhotographyChallenge/Week3",
        "title": "Photography Challenge - Week 3 - Your favourite colour"
      },
      {
        "key": "PhotographyChallenge/Week2",
        "title": "Photography Challenge - Week 2 - Something that inspires you"
      },
      {
        "key": "PhotographyChallenge/Week1",
        "title": "Photography Challenge - Week 1 - Self-Portrait"
      }
    ]
  },
  "blog/PhotographyChallenge/Week1/index.html": {
    "template": "standard.pug",
    "description": "Week 1 - Self-Portrait",
    "title": "Week 1 - Self-Portrait",
    "sections": [
      {
        "type": "text",
        "value": "Shantel is challenging herself and I to a 52 week photography challenge. Each week we will take a certain type of picture and experiment with different settings on the camera and/or post-processing techniques."
      },
      {
        "type": "text",
        "value": "The first week is self-portraits. I don't like taking pictures of myself so this wasn't the most fun one to start off with. We recently however received our Octopus Energy octopus plushie so I decided to take my picture with the pink and cuddly Constantine."
      },
      {
        "type": "text",
        "value": "The first image is without any editing. Nothing special when taking the picture but I did want to make use of my Adobe Photoshop Elements trial to test out the colour pop capabilities."
      },
      {
        "type": "text",
        "value": "The second image is the final result. I quite like the effect, it really makes Constantine pop out."
      },
      {
        "type": "gallery",
        "images": [
          {
            "filename": "/images/blog/photography_challenge_week_1_before.jpg",
            "thumbnail": "/images/blog/photography_challenge_week_1_before_thumb.jpg",
            "caption": "The unedited image of myself and Constantine"
          },
          {
            "filename": "/images/blog/photography_challenge_week_1_after.jpg",
            "thumbnail": "/images/blog/photography_challenge_week_1_after_thumb.jpg",
            "caption": "The edited image of myself and Constantine. Mostly black and white, only Constantine is in colour"
          }
        ]
      }
    ]
  },
  "blog/PhotographyChallenge/Week2/index.html": {
    "template": "standard.pug",
    "description": "Week 2 - Something that inspires you",
    "title": "Week 2 - Something that inspires you",
    "sections": [
      {
        "type": "text",
        "value": "Week 2 of the photography challenge is \"Something that inspires you\". I really struggled to come up with a subject to take a picture of so instead I'm just going to take one of my favourite pictures that I have taken so far."
      },
      {
        "type": "text",
        "value": "When some close friends were up to visit, we went to see the highland cows that live a couple of minutes from our house. For the first time in the four years that I've lived there, one of the cows came up to see us and was happy to receive some pets!"
      },
      {
        "type": "gallery",
        "images": [
          {
            "filename": "/images/blog/photography_challenge_week_2.jpg",
            "thumbnail": "/images/blog/photography_challenge_week_2_thumb.jpg",
            "caption": "The unedited image of the highland cow"
          }
        ]
      }
    ]
  },
  "blog/PhotographyChallenge/Week3/index.html": {
    "template": "standard.pug",
    "description": "Week 3 - Your favourite colour",
    "title": "Week 3 - Your favourite colour",
    "sections": [
      {
        "type": "text",
        "value": "Week 3 of the photography challenge is \"Your favourite colour\". My favourite colour is blue. I was spoilt for choice when choosing a subject since we have lots of blue items."
      },
      {
        "type": "text",
        "value": "The subject I chose was our car - a 2nd generation Honda Jazz that Shantel named 'Gatsby'. We've had the car for just over a year and he's helped Shantel master the UK roads."
      },
      {
        "type": "text",
        "value": "The photograph is shown below. Apart from erasing our number plate, I added lots of background blur to make the car stand out."
      },
      {
        "type": "gallery",
        "images": [
          {
            "filename": "/images/blog/photography_challenge_week_3.jpg",
            "thumbnail": "/images/blog/photography_challenge_week_3_thumb.jpg",
            "caption": "A picture of our Honda Jazz, Gatsby, with lots of background blur"
          }
        ]
      }
    ]
  },
  "blog/PhotographyChallenge/Week4/index.html": {
  "template": "standard.pug",
  "description": "Week 4 - Black and White",
  "title": "Week 4 - Black and White",
  "sections": [
    {
      "type": "text",
      "value": "Week 4 of the photography challenge is \"Black and White\". The weather has been terrible so I haven't wanted to go out and take pictures outside very often. I had thought about trying to grab a picture of some interesting Halloween decorations but there hasn't been many near where I live."
    },
    {
      "type": "text",
      "value": "Instead I took a picture of my morning cup of coffee. I had also tried to take a picture of the milk being poured into the cup. I had limited success - it was quite tricky holding the camera while pouring the milk! A tripod would have gone a long way to help."
    },
    {
      "type": "text",
      "value": "This is also the first time I have posted a picture with our new lens - the Canon EF-M 22mm \"pancake\". I was able to buy one from eBay for around 50% the recommended retail price of a brand new one. It's our first prime lens (our others are the 15-45mm and 55-200mm lenses from Canon). I've heard good things about the 22mm, especially for its better low light performance and street photography relative to the 15-45mm kit lens. Time will tell!"
    },
    {
      "type": "gallery",
      "images": [
        {
          "filename": "/images/blog/photography_challenge_week_4.jpg",
          "thumbnail": "/images/blog/photography_challenge_week_4_thumb.jpg",
          "caption": "A cup of coffee and a chocolate biscuit"
        }
      ]
    }
  ]
}
}
