{
  "projects/index.html": {
    "template": "list.pug",
    "description": "List of software development projects",
    "title": "Software Projects",
    "directory": "projects",
    "list": [
      {
        "key": "DocumentFiltering",
        "title": "GPU-Accelerated Document Filtering in OpenCL"
      },
      {
        "key": "LES",
        "title": "Exploring the parallelisation of the Large Eddy Simulation using MPI and the Glasgow Model Coupling Framework in Fortran"
      },
      {
        "key": "PersonalWebsite",
        "title": "This website"
      },
      {
        "key": "AdventOfCode2021",
        "title": "Advent of Code 2021"
      }
    ]
  },
  "projects/DocumentFiltering/index.html": {
    "template": "standard.pug",
    "description": "Information on 4th year undergraduate project",
    "title": "GPU-Accelerated Document Filtering in OpenCL",
    "sections": [
      {
        "type": "url",
        "text": "Github",
        "url": "https://github.com/jessr92/Level4Project"
      },
      {
        "type": "text",
        "value": "Document filtering a is problem of growing importance. The advent of the Internet has resulted in a massive surge in the transfer and storage of data and information. A prime example is email where hundreds of billions are sent every day. Emails, and other kinds of documents, require to be filtered. This problem is highly data parallel in nature as the classification of one document does not affect the classification of another. The project investigates the viability of using GPUs rather than CPUs for the classification. GPUs are designed with parallel problems in mind and thus have the potential to allow for significantly higher throughput compared with CPUs."
      }
    ]
  },
  "projects/LES/index.html": {
    "template": "standard.pug",
    "description": "Information on final year undergraduate project",
    "title": "Exploring the parallelisation of the Large Eddy Simulation using MPI and the Glasgow Model Coupling Framework in Fortran",
    "sections": [
      {
        "type": "url",
        "text": "Github",
        "url": "https://github.com/jessr92/LES-WRF-MPI"
      },
      {
        "type": "text",
        "value": "Climate scientists write a number of applications to simulate aspects of our planet's ecosystem. These are sometimes coupled with other simulations using model coupling frameworks. This improves the accuracy of results and allows climate scientists to model more complicated scenarios. The Glasgow Model Coupling Framework (GMCF) is a new kind of model coupling framework that can also be used to parallelise individual models. By comparing LES performance when parallelised by MPI and GMCF, it is shown that GMCF offers competitive performance with MPI while also providing model coupling functionality."
      }
    ]
  },
  "projects/PersonalWebsite/index.html": {
    "template": "standard.pug",
    "description": "Information on the project that generates this website",
    "title": "This website",
    "sections": [
      {
        "type": "url",
        "text": "Github",
        "url": "https://github.com/jessr92/Personal-Website"
      },
      {
        "type": "text",
        "value": "This website is hosted on github.io and I have written a very basic TypeScript wrapper around Pug which reads in JSON files and generates the required HTML pages. It's a \"static website generator\" of sorts but one that only contains sufficient functionality for my use cases and nothing else."
      }
    ]
  },
  "projects/AdventOfCode2021/index.html": {
    "template": "standard.pug",
    "description": "My solutions for the Advent of Code 2021 challenge",
    "title": "Advent of Code 2021",
    "sections": [
      {
        "type": "url",
        "text": "Github",
        "url": "https://github.com/jessr92/advent-of-code-2021"
      },
      {
        "type": "text",
        "value": "I decided to try doing the Advent of Code 2021 challenge. My solutions are implemented in Java 17 with no particular aims or restrictions on my solutions. I'm just doing it for the fun of solving the puzzles."
      }
    ]
  }
}
